{
  "saturday": [
    {
      "name": "Opening Ceremony",
      "begin": 900,
      "description": "Size Con's Official kick-off ceremony with short speeches by those behind this one of a kind event!"
    },
    {
      "name": "Wonderland Way",
      "begin": 900,
      "end": 0,
      "description": "Attending SizeCon? Well you'll have to take a stroll through Wonderland Way, filled with size-related props to take photos with, vendors and tons of size related games for you to demo! If you ever need to take a break from the crowd, head on over to Wonderland Way where something fun is always going on!"
    },
    {
      "name": "SizeCon Escape the Room",
      "begin": 1000,
      "end": 2100,
      "description": "SizeCon programming expands to include its first ESCAPE ROOM!\nAn enthusiastic attendee to SizeCon brought along a bottle marked \"Drink Me\" with the hopes of experiencing their fantasy. Well, the potion may have worked too well because that Con-goer is now missing. Certain items were left behind with clues too small to be seen...unless teams of people are shrunk down to one-sixth their size. Who's willing to take a fantastic voyage and solve this oversized mystery? Can it be done in forty-five minutes before the reduction process reverts? Come to SizeCon 2020 and find out!"
    },
    {
      "name": "The Vendor's Room",
      "begin": 930,
      "end": 2100,
      "description": "Have yourself edited into a size photo in real time, meet your favorite models, and buy prints, goods and services from our talented exhibitors. This year's Size Con will have a range of products available, including comic books, clothing, figurines, prints, badges, kinky toys, keychains and so much more!"
    },
    {
      "name": "Newbies Social",
      "begin": 930,
      "description": "Across the country, and even abroad, we've all gathered here today because we all have one thing in common: OUR LOVE OF SIZE! What brought you to Size Con this year? What do you hope to gain from your time here? Mingle with fellow Size fans and let's get rid of those Size-Con jitters together!"
    },
    {
      "name": "Real Life Expansion Workshop",
      "begin": 1000,
      "description": "Join us for a live demonstration with your favorite expansion models performing live saline breast injections and belly inflating."
    },
    {
      "name": "Underfoot Social",
      "begin": 1000,
      "description": "Whether manicured or hairy, platformed or stinky, this is the one social dedicated to our Foot worshippers! Come and discuss your love of Size and Feet!"
    },
    {
      "name": "Uneven and Extreme Size Social",
      "begin": 1000,
      "description": "Do you like beings who can grow to planetary sizes? Or microscopic tinies? How about growth or shrinking that affects one body part at a time? If you've answered yes, you're in good company! Come join us for a hearty discussion on Uneven & Extreme Size!"
    },
    {
      "name": "Katharine Gates: A Tour of the Erotic Edge",
      "begin": 1100,
      "description": "Meet Yale-Trained Anthropologist and Author Katharine Gates as she tells the stories behind her popular new book Deviant Desires: A Tour of the Erotic Edge."
    },
    {
      "name": "MLM Social",
      "begin": 1100,
      "description": "Welcome to the Men love Men social - A space at Size Con for men to talk to other men about their love for growing, shrinking and/or expanding dudes!"
    },
    {
      "name": "Lunch Break",
      "begin": 1200
    },
    {
      "name": "Cosplay Parade",
      "begin": 1245,
      "description": "Time to show off in our Cosplay Parade! Whether you’ve been working on an outfit from an established universe or a completely original character, have the kinkiest getup or your fiercest drag, break out your best costumes and show us what you’ve got! Size related costumes are encouraged!"
    },
    {
      "name": "BE Event: The B.o.O.B. Show",
      "begin": 1300,
      "description": "Join a live audience for the live premiere of \"Busted or Outrageously Busted\", a question-and-answer game show where a bevy of contestants play to win the bustlines of their dreams without winning too much of a good thing! Featuring Host Bub Zealby."
    },
    {
      "name": "Tall Tails Social",
      "begin": 1300,
      "description": "Furries unite! The furry-size community is robust, unique and growing! Let's discuss our love of size, paws, tails and sharp maws included!"
    },
    {
      "name": "Relationships Panel",
      "begin": 1400,
      "description": "This panel is run by couples, sharing their experiences involving size dynamics in their relationships. The discussion will also include advice on coming out to a partner, exploring and sharing your desires with someone who wants to share in what you enjoy, and the lessons learned over time!"
    },
    {
      "name": "Tans Size Social",
      "begin": 1400,
      "description": "Welcome to the Trans size Social - This social is for those in the community who are Transgender and want to share their own unique life experiences, share Size fantasies and their own experiences in the Size Community."
    },
    {
      "name": "Microphile Panel",
      "begin": 1500,
      "description": "This panel is all about those who like to grow to giant sizes or shrink others! Come join the discussion with our diverse group of panelists!"
    },
    {
      "name": "Weight Gain Social",
      "begin": 1500,
      "description": "Consensual, intentional weight gain can be a hot button issue. Issues such as monetary the costs involved, lifestyle/health choices and social taboo all play a major role. Feeders, feedees, gainers, and anyone interested in discussing the ups and downs of the Weight Gain community are invited to join us for an hour long group discussion."
    },
    {
      "name": "Size History Panel",
      "begin": 1600,
      "description": "How did we as a community get here? Well, it's time you hear it straight from the lips of those who started it all! Featuring Bust-Artist, The-Minimizer, The Reducer, and other special guests!"
    },
    {
      "name": "Hungry Hunks Social",
      "begin": 1600,
      "description": "Rumbly bellies make you weak, open maws make you moan, and the thought of being swallowed by a sexy Giant man drives you crazy! Vore fans unite and discuss hungry hunks who can't get enough tiny snacks like you! Hungry giants and foolish prey welcome."
    },
    {
      "name": "D&D Campaign: SizeCon the RPG",
      "begin": 1600,
      "end": 1900,
      "description": "There’s treasure to be grabbed, monsters to tackle, and traps to avoid, but this time our party of adventurers is going to have to deal with a different scale of challenge. Back by popular demand, join some of the best GMs from within the Size community to roll some dice and see just how dangerous a few magic spells in the wrong hands can be! Spots do fill up, so we highly suggest to Pre-Register now by contacting us at: sizeconrpg@gmail.com"
    },
    {
      "name": "Dirty Talk: Finding Your 'Filthy Voice'",
      "begin": 1700,
      "description": "Ever had a partner say something sexy that sent shivers down your spine, or got a text that kept you hard all day? Join Dee for an explicit talk about talking explicitly! We'll cover some different styles of dirty talk, communicating your preferences to your partner, and fun ways to utilize your \"filthy voice\" - both in and out of the bedroom."
    },
    {
      "name": "Size Supporters Social",
      "begin": 1700,
      "description": "We know. We're sometimes a lot to deal with. But we know you love us, because you're here at SizeCon celebrating with us! If you are not a size fan but here to support someone, stop by this social to speak with other folks who are also in relationships with a size partner or partners! Share experiences, tips, vent, etc. You are part of the community too, so feel free to participate in a casual, private setting, in a space just for you!"
    },
    {
      "name": "BDSM 101",
      "begin": 1800,
      "description": "The Eulenspiegel Society (TES) returns with a thorough rundown of BDSM and D/s practices, terminology, and events outside of Size Con to explore your own Power-Play fantasies."
    },
    {
      "name": "The Fluffy Feels Social",
      "begin": 1800,
      "description": "Sometimes we just want to enjoy Size-play without the sex. Gather together to have a lighter, fluffier, and more traditionally romantic side of Size!"
    },
    {
      "name": "Gulliveria Cafe",
      "begin": 1800,
      "description": "Thirsty? Join us for an unforgettable Giantess experience at our new and improved interactive Role-Play and Variety Cafe Show experience! Headlined by the talented and beautiful Raquel Roper, we'll be featuring several acts by our crew of stunning Giantess performers - Entry is free, so don't miss it! Complementary Tea or Coffee is available if you can show Miss Kaneda and Giantess Hex you are worthy. Tips appreciated!"
    },
    {
      "name": "Gulliverian Cafe",
      "begin": 1900,
      "description": "Thirsty? Join us for an unforgettable Giant Man experience at our new and improved interactive Role-Play and Variety Cafe Show experience! Headlined by the talented and hunky Miles Striker, featuring Leucan and his Magical Endoscope performance and GiantGripper's tantalizing burlesque - Entry is free, so don't miss it! Complementary Tea or Coffee is available if you can convice our staff of tall bois to even notice you."
    },
    {
      "name": "Gender Fluidity & Size Social",
      "begin": 1900,
      "description": "For those who enjoy exploring their size interest in a gender-fluid, gender-swapping or agender way."
    },
    {
      "name": "Inflation & Expansion Panel",
      "begin": 2000,
      "description": "If you're fascinated by body parts swelling out of proportion, sometimes to absolutely absurd sizes, or love seeing characters inflated like balloons, this is the panel for you! Come join a robust discussion with our panel!"
    },
    {
      "name": "Welcome to the Darkside",
      "begin": 2000,
      "description": "Not for the faint of heart! This panel is for lovers of size-related cruel delights - violence, humiliation, death. This panel will discuss size and the intersection of sadomasochism, self-acceptance, and embracing your sexuality."
    },
    {
      "name": "The Blueberry Inflation Social",
      "begin": 2100,
      "description": "For those who like them round, juicy blueberries - come sit and discuss how your interests came to be and how you enjoy them today!"
    },
    {
      "name": "Playing Smart Workshop with Miles Striker",
      "begin": 2100,
      "description": "Interested in how to convert your fantasies into real life roleplay? Learn BDSM basics from Pro-Dom Miles Striker, where he'll show you how to whip, slap, choke, and more - the safe way! We highly reccomend attending this class if you'll be attending our Playroom."
    },
    {
      "name": "SizeCon Playroom",
      "begin": 2200,
      "end": 0,
      "description": "Join us for a casual gathering where fantasy meets reality in SizeCon's first ever Playroom - Go on get your roleplay on! Feel free to chitchat with your friends, humiliate your tiny submissive in front of everyone or both! Participation is optional. While some equipment maybe available for use, any personal items (i.e. ropes, toys, etc) must be provided by you. Optional nudity will be allowed after 11PM."
    },
    {
      "name": "Ant-man and The Wasp",
      "begin": 2200,
      "end": 0,
      "description": "Watch Marvel's 2018 film Antman & the Wasp with the most awesome crowd ever!"
    },
    {
      "name": "SizeCon Day 1 Finished!",
      "begin": 0,
      "end": 0
    },
    {
      "name": "Adult Swim Pool Party",
      "begin": 0,
      "end": 200,
      "description": "Kid's out of the pool - it's Adult Swim! While the convention floor is closed, the party continues at the Radisson's indoor pool and jacuzzi. Join this SizeCon attendee exclusive party where clothes are optional and respect for fellow attendees is mandatory."
    }
  ],
  "sunday": []
}
